tap "arl/arl"
tap "azure/kubelogin"
tap "carvel-dev/carvel"
tap "derailed/k9s"
tap "deskflow/tap"
tap "falcosuessgott/tap"
tap "felixkratz/formulae"
tap "hashicorp/tap"
tap "homebrew/services"
tap "jesseduffield/lazygit"
brew "aichat"
brew "asdf"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "readline"
brew "sqlite"
brew "awscli"
brew "azure-cli"
brew "bat"
brew "bison"
brew "btop"
brew "chezmoi"
brew "cmake"
brew "cmatrix"
brew "colima", restart_service: :changed
brew "compiledb"
brew "cpio"
brew "curl"
brew "kubernetes-cli"
brew "devspace"
brew "dialog"
brew "direnv"
brew "docker"
brew "doggo"
brew "doppler"
brew "duf"
brew "eza"
brew "fd"
brew "feh"
brew "ffmpeg"
brew "flex"
brew "fnm"
brew "fx"
brew "fzf"
brew "gcc"
brew "git-delta"
brew "gnupg"
brew "go"
brew "graphviz"
brew "grc"
brew "helm"
brew "htop"
brew "imagemagick"
brew "ipinfo-cli"
brew "jc"
brew "jq"
brew "just"
brew "kubie"
brew "lastpass-cli"
brew "lazygit"
brew "lsd"
brew "luarocks"
brew "neovim"
brew "nmap"
brew "numpy"
brew "nvm"
brew "openconnect"
brew "p7zip"
brew "pipx"
brew "pkgconf"
brew "pyenv"
brew "python-setuptools"
brew "qemu"
brew "rename"
brew "ripgrep"
brew "starship"
brew "tcl-tk@8"
brew "tcptraceroute"
brew "tealdeer"
brew "telnet"
brew "terragrunt"
brew "tmux"
brew "unzip"
brew "uv"
brew "viddy"
brew "wget"
brew "xclip"
brew "xdotool"
brew "xz"
brew "yq"
brew "yt-dlp"
brew "ytt"
brew "zellij"
brew "zinit"
brew "zlib"
brew "zoxide"
brew "zsh"
brew "arl/arl/gitmux"
brew "azure/kubelogin/kubelogin"
brew "carvel-dev/carvel/vendir"
brew "derailed/k9s/k9s"
brew "falcosuessgott/tap/vkv"
brew "felixkratz/formulae/sketchybar"
brew "hashicorp/tap/terraform"
brew "anomalyco/tap/opencode"
cask "bruno"
cask "copyq"
cask "deskflow/tap/deskflow"
cask "localsend"
cask "macfuse"
cask "osxfuse"
cask "swiftbar"
cask "temurin"
cask "wezterm"
vscode "4ops.terraform"
vscode "aaron-bond.better-comments"
vscode "adriansanguineti.json-parse-validator"
vscode "anthropic.claude-code"
vscode "anysphere.cursorpyright"
vscode "anysphere.pyright"
vscode "bung87.vscode-gemfile"
vscode "catppuccin.catppuccin-vsc"
vscode "ciantic.keymapceditor-vsc"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "gitlab.gitlab-workflow"
vscode "golang.go"
vscode "hashicorp.terraform"
vscode "humao.rest-client"
vscode "ipedrazas.kubernetes-snippets"
vscode "janisdd.vscode-edit-csv"
vscode "jebbs.plantuml"
vscode "jordanhury.sqltools-cassandra"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "mtxr.sqltools"
vscode "pkief.material-icon-theme"
vscode "qwtel.sqlite-viewer"
vscode "redhat.vscode-yaml"
vscode "run-at-scale.terraform-doc-snippets"
vscode "sianglim.slim"
vscode "spadin.zmk-tools"
vscode "svelte.svelte-vscode"
vscode "vscodevim.vim"
vscode "vue.volar"
vscode "waderyan.gitblame"
krew "ctx"
krew "konfig"
krew "krew"
krew "ktop"
krew "neat"
krew "ns"
krew "resource-capacity"
krew "sniff"
krew "stern"
krew "tree"
krew "radar"
npm "corepack"
